shaspitz/orbit-stabilization/ME135_235/PIXY2LabVIEW.cydsn/Generated_Source/PSoC5/PIXY2UARTReset.h
/*******************************************************************************
* File Name: PIXY2UARTReset.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_PIXY2UARTReset_H) /* CY_CONTROL_REG_PIXY2UARTReset_H */
#define CY_CONTROL_REG_PIXY2UARTReset_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} PIXY2UARTReset_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    PIXY2UARTReset_Write(uint8 control) ;
uint8   PIXY2UARTReset_Read(void) ;

void PIXY2UARTReset_SaveConfig(void) ;
void PIXY2UARTReset_RestoreConfig(void) ;
void PIXY2UARTReset_Sleep(void) ; 
void PIXY2UARTReset_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define PIXY2UARTReset_Control        (* (reg8 *) PIXY2UARTReset_Sync_ctrl_reg__CONTROL_REG )
#define PIXY2UARTReset_Control_PTR    (  (reg8 *) PIXY2UARTReset_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_PIXY2UARTReset_H */


/* [] END OF FILE */
